Revit 2027 API
BuiltInFailures.RenderFailures.LightSourceInsideGeometry Property
 Light source is inside solid geometry. No light will be emitted during rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LightSourceInsideGeometry { get; }
Public Shared ReadOnly Property LightSourceInsideGeometry As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LightSourceInsideGeometry {
	FailureDefinitionId^ get ();
}
static member LightSourceInsideGeometry : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RenderFailures Class
Autodesk.Revit.DB Namespace